//base_02.js

console.log("base_02.js 연결 완료");

console.log(10+10); // 20 (숫자+숫자는 연산된 결과값)
console.log("10"+10); // 1010 (문자+숫자는 문자로 인식되어 나열 되어 출력)
console.log("10"+"10"); // 1010 (문자+문자는 문자로 인식 되어 나열 되어 출력)

// js 내에는 다양한 형 타입이 존재한다.
// 숫자는 따옴표를 붙이지 않는다.
// 문자는 따옴표로 감싸서 표기 한다. 
// ㄴjsvascript는 "와 '를 구분하지 않는다.
// ㄴ단 시작과 끝이 동일한 따옴표여야 한다.
// 따옴표를 사용하지 않고 표기하는 문자도 있는데, 이를 변수, 함수, 객체, 배열 등등이다.

var 낄끼빠빠="낄 때 끼고 빠질 때 빠져라";
console.log(낄끼빠빠);

var coffee ="포션";
console.log(coffee);

coffee="후식";
console.log(coffee);

// 변수: 변하는 수라는 사전적 의미를 가지고 있으나, 프로그래밍 언어에서는 하나의 기능 또는 내용을 요약하여 담는 기능을 한다.
// 더 뒤에 대입한 답으로 기억 된다.
// 값뿐 아니라 기능을 담을 수도 있으나, js 외 다른 언어에서는 값만 담을 수 있다.
// 변하지 않는 수에 대해서는 상수라고 불리우며, 최초에 한 번만 등록 된다.
// 변수는 최초에 한 번 var 라고 선언한다. 이후 동일한 변수에 다른 값을 대입할 때에는 var를 선언하지 않는다.

// 2015년 이후, ECMA2015(es6) 버전이 등장하면서 var 변수 대신에 const(상수)와 let(변수)을 이용한 변수가 등장했다.
// ";" 작성하는 곳: ;의 의미는 기능 종료를 뜻한다. (한 문장의 종료)
// 변수 선언 후 마지막에 입력하거나, 함수나 메소드 작성 후 마지막에 입력.
// ㄴ변순 선언 후 마지막 => var coffee ="포션";
// ㄴ함수/메소드의 마지막 => 함수명();